<?php
echo "<br><br>--------------Задание 3B Города--------------<br><br>";

$regions = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Касимов", "Рязань", "Крутоярский", "Пашма"]
];

foreach ($regions as $region => $cities) {
    echo "{$region}:<br>";
    $cityList = "";

    for ($i = 0; $i <= count($cities); $i++) {
        echo $cities[$i];
        if ($i + 1 < count($cities)) {
            echo ", ";
        } else {
            echo "<br>";
        }
    }
}